app/controllers/wishlists_controller.rb

  def add

    # checkIfInDatabase = Listing.find_by(domain_id: params[:domainId])
    checkIfInDatabase = User.last.listings.find_by(domain_id: params[:domainId])
    puts checkIfInDatabase

    if checkIfInDatabase.nil?
      listing = Listing.create headline:params[:headline], image:params[:image], address:params[:address], latitude: params[:latitude], longitude: params[:longitude], domain_id: params[:domainId]
---
SELECT  "listings".* FROM "listings" INNER JOIN "listings_users" ON "listings"."id" = "listings_users"."listing_id" WHERE "listings_users"."user_id" = $1 AND "listings"."domain_id" = $2 LIMIT $3  [["user_id", 40], ["domain_id", 2015397760], ["LIMIT", 1]]
INSERT INTO "listings" ("headline", "image", "address", "latitude", "longitude", "created_at", "updated_at", "domain_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    listing = Listing.find params[:id]
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]