app/models/token.rb

  def self.access_token

    t = Token.last.current_token
    puts 't is:', t

    if t == '1'
      puts 'Token is empty'
      get_token = Token.token_request_from_domain
      t = get_token["access_token"]
    end

    # Update the model with the token now
    Token.update_all(current_token: t)
---
SELECT  "tokens".* FROM "tokens" ORDER BY "tokens"."id" DESC LIMIT $1  [["LIMIT", 1]]
UPDATE "tokens" SET "current_token" = NULL